In [2]:
import pandas as pd
import numpy as np

In [4]:
# 1~10까지의 임의의 수를 3*3 배열에 생성한다.
np.random.randint(1,10,(3,3))

array([[1, 3, 1],
       [7, 5, 3],
       [8, 2, 8]])

In [5]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),
                   columns = list('ABC'))
df_1

   A  B  C
0  6  6  5
1  2  5  1
2  4  8  5

In [6]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),
                   columns = list('CAB'))
df_2

   C  A  B
0  4  9  6
1  4  4  9
2  3  1  6

In [7]:
# 현재의 프레임은 유지되면서 각종 연산함수의 값이 각각의 원소에 업데이트 한다.
np.log(df_2)

          C         A         B
0  1.386294  2.197225  1.791759
1  1.386294  1.386294  2.197225
2  1.098612  0.000000  1.791759

In [9]:
# 이름이 같은 열끼리 계산한다.
df_1+df_2

    A   B  C
0  15  12  9
1   6  14  5
2   5  14  8

In [11]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)),
                   columns = list('CB'))
df_3

   C  B
0  6  4
1  8  8
2  1  1

In [12]:
# df_3은 A열이 없으므로 없는 값(NaN)과의 연산으로 A열의 모든 값은 NaN이 된다.
df_1+df_3

    A   B   C
0 NaN  10  11
1 NaN  13   9
2 NaN   9   6